package new_task.task_7;

import java.util.Map;
import java.util.stream.Collectors;

public class Multipliers {
    public static final double REDUCE_MULTIPLIER_FOR_SLOTS_GAME = 0.8;
    private static final Map<String, Double> HONEST_SLOTS_MULTIPLIERS = Map.ofEntries(

            //toDo КФ последовательности считать по "Не чистым" шансам, хоть и доступные варианты берутся по "Чистым"
            // т.к. последовательности покрывают их разницу (за них больший КФ)

            // 5 слотов
            Map.entry("5_5s", 5000.0), // Честный кф - 10000 // 10*1*1*1*1 = 10 -> 0.01% ++
            Map.entry("5_4r+2s+2s", 747.0), // Честный кф - 1111 // 10*1*9*1*1 *1(способ) = 90 -> 0.09% ++
            Map.entry("5_4s", 404.0), // Честный кф - 556 // 10*1*1*1*9 *2(способа) = 180 -> 0.18% ++
            Map.entry("5_3s+2s", 391.0), // Честный кф - 556 // 10*1*1*9*1 *2(способа) = 180 -> 0.18% ++
            Map.entry("5_3r+2r", 80.2), // Честный кф - 111 // 10*9*1*1*1 *1(способ) = 900 -> 0.9% ++
            Map.entry("5_4r+3s", 389.0), // Честный кф - 556 // 10*9*1*1*1 *2(способа) = 180 -> 0.18% ++
            Map.entry("5_2r+3s", 378.0), // Честный кф - 556 // 10*9*1*1*1 *1(способ) = 90 -> 0.09% ++
            Map.entry("5_3r+2s+2s", 394.0), // Честный кф - 556 // 10*9*1*1*1 *2(способа) = 180 -> 0.18% ++
            Map.entry("5_3s", 35.8), // Честный кф - 46.3 // 10*1*1*9*8 *3(способа) = 2160 -> 2.16% ++
            Map.entry("5_2s+2s", 32.9), // Честный кф - 46.3 // 10*1*9*1*8 *3(способа) = 2160 -> 2.16% ++
            Map.entry("5_3r+2s", 20.34), // Честный кф - 27.8 // 10*9*8*1*1 *6(способов) = 4320 -> 4.32% ++
            Map.entry("5_2r+2r", 6.83), // Честный кф - 9.25 // = 10800 -> 10.8% ++
            Map.entry("5_2r+2s", 14.72), // Честный кф - 23.1 // 10*9*8*1*1 *6(способов) = 4320 -> 4.32% ++
            Map.entry("5_3r", 14.0), // Честный кф - 19.8 // 10*1*1*9*9 *10(способов) = 8100 -> 8.1% ++
            Map.entry("5_2s", 3.51), // Честный кф - 4.9 // 10*1*9*8*7 *4(способа) = 20160 -> 20.16% ++
            Map.entry("5_2r", 2.38), // Честный кф - 1.98 // 10*9*8*7*1 *10(способов) = 50400 -> 50.4% ++

            // 4 слота - 10 000 комбинаций
            Map.entry("4_4s", 300.0), // Честный кф - 1000 // 10*1*1*1 = 10 -> 0.1%
            Map.entry("4_2r+2r", 18.52), // Честный кф - 18.52 // 10*9*1*1 *6(способов) = 540 -> 5.4% ++
            Map.entry("4_2r+2s", 37.04), // Честный кф - 111.11 // 10*9*1*1 *1(способ) = 90 -> 0.9% ++
            Map.entry("4_3r+2s", 45.61), // Честный кф - 55.56 // 10*9*1*1 *2(способа) = 180 -> 1.8% ++
            Map.entry("4_2s+2s", 37.04), // Честный кф - 55.56 // 10*1*9*1 *2(способа) = 180 -> 1.8% ++
            Map.entry("4_3s", 27.78), // Честный кф - 55.56 // 10*1*1*9 *2(способа) = 180 -> 1.8% ++
            Map.entry("4_2s", 4.63), // Честный кф - 4.63 // 10*1*9*8 *3(способа) = 2160 -> 21.6% ++
            Map.entry("4_2r", 2.31), // Честный кф - 2.31 // 10*9*8*1 *6(способов) = 4320 -> 43.2% ++

            // 3 слота - 1 000 комбинаций
            Map.entry("3_3s", 100.0), // Честный кф - 100 // 10*1*1 = 10 -> 1% ++
            Map.entry("3_2s", 5.56), // Честный кф - 5.56 // 10*1*9 *2(способа) = 180 -> 18% ++
            Map.entry("3_2r", 3.7), // Честный кф - 3.7 // 10*1*9 *3(способа) = 270 -> 27% ++

            // 2 слота - 100 комбинаций
            Map.entry("2_2s", 10.0) // Честный кф - 10 // 10*1 = 10 -> 10%
    );

    public static final Map<String, Double> SLOTS_MULTIPLIERS;

    static {
        SLOTS_MULTIPLIERS = getSlotsMultipliers();
    }

    private static Map<String, Double> getSlotsMultipliers() {
        return HONEST_SLOTS_MULTIPLIERS.entrySet().stream().
                collect(Collectors.toMap(
                        Map.Entry::getKey,
                        entry -> Utils.getClearMultiplier(entry.getValue() * REDUCE_MULTIPLIER_FOR_SLOTS_GAME)
                ));
    }
}
